/**
* Модуль функций обработки бумагой
* @file
*/

#include "paper.h"

papers_t Papers[MAX_PAPERS] = {
    { {0,0,0,0}, { 210, 297 }, { IDS_PAPER1, IDS_PAPER1 } },    // 0 a4
    { {0,0,0,0}, { 297, 210 }, { IDS_PAPER6, IDS_PAPER6 } },    // 1 a4 other
    { {0,0,0,0}, { 210, 0   }, { IDS_PAPER3, IDS_PAPER5 } },    // 2 узкая рулонная
    { {0,0,0,0}, { 420, 0   }, { IDS_PAPER3_P, IDS_PAPER4 } },  // 3 широкая рулонная
    { {0,0,0,0}, { 420, 297 }, { IDS_PAPER8, IDS_PAPER3 } },    // 4 a3              .
    { {0,0,0,0}, { 420, 297 }, { 0         , IDS_PAPER2 } },    // 5 фальцованная
    { {0,0,0,0}, { 210, 297 }, { 0         , 0          } },    // 6 пользовательская...
    { {0,0,0,0}, { 297, 420 }, { 0         , IDS_PAPER3_P } }   // 7 a3 portrait
};

PapersWidth_t PapersWidth= 
{
                //  P    E   PC   EC
        {       // Epson 
                {   0,   0,   0,   0 },         //
                {  75,  90, 135, 153 },         // a4 portrait
                { 112, 135, 195, 222 },         // a4 landscape
                {  75,  90, 135, 153 },         // narrow
                { 135, 163, 230, 267 },         // wide 
                { 135, 163, 230, 267 },         // A3
                { 135, 163, 230, 267 },         // A3 falcov
                { 112, 135, 195, 222 }          // a3 landscape
        },
        {       // Win
                {   0,   0,   0,   0 },         //
                {  69,  84, 121, 137 },         // a4 portrait
                { 107, 130, 188, 212 },         // a4 landscape
                {  69,  84, 121, 137 },         // narrow
                { 135, 163, 236, 266 },         // wide 
                { 135, 163, 236, 266 },         // A3
                { 135, 163, 236, 266 },         // A3 falcov
                { 107, 130, 188, 212 }          // a3 landscape
        }
};


